mkasenberg/mynewt-nimble/nimble/drivers/nrf5x/src/ble_phy.c
    return 0;
}

static int
ble_phy_transition(uint8_t transition, uint8_t tifs_anchor, uint16_t tifs_usecs,
                   uint16_t wfr_usecs, uint8_t phy_state)
{
    int rc = 1;

    if (transition == PHY_TRANS_TO_TX) {
        rc = ble_transition_to_tx(tifs_anchor, tifs_usecs, wfr_usecs, phy_state);
    } else if (transition == PHY_TRANS_TO_RX) {
        rc = ble_transition_to_rx(tifs_anchor, tifs_usecs, wfr_usecs, phy_state);
    }

    if (rc) {
        ble_transition_to_none();
    }

    return 0;
}

/**
 * Called from interrupt context when the transmit ends
 *
 */
static void
ble_phy_tx_end_isr(void)
{
    uint8_t was_encrypted;
    uint8_t transition;
    uint16_t wfr_usecs;
    uint16_t tifs_usecs;
    uint8_t tifs_anchor;

#if MYNEWT_VAL(BLE_CHANNEL_SOUNDING)
    g_ble_phy_data.txend_time_ticks = NRF_TIMER0->CC[2] +
            g_ble_phy_t_txenddelay[g_ble_phy_data.phy_cur_phy_mode];
#endif

    /* If this transmission was encrypted we need to remember it */
    was_encrypted = g_ble_phy_data.phy_encrypted;
    (void)was_encrypted;

    /* Better be in TX state! */
    assert(g_ble_phy_data.phy_state == BLE_PHY_STATE_TX);

#if MYNEWT_VAL(BLE_LL_CFG_FEAT_LE_ENCRYPTION)
    /*
     * XXX: not sure what to do. We had a HW error during transmission.
     * For now I just count a stat but continue on like all is good.
     */
    if (was_encrypted) {
        if (NRF_CCM->EVENTS_ERROR) {
            STATS_INC(ble_phy_stats, tx_hw_err);
            NRF_CCM->EVENTS_ERROR = 0;
        }
    }
#endif

    transition = g_ble_phy_data.phy_transition;
    wfr_usecs = g_ble_phy_data.wfr_usecs;
    tifs_usecs = g_ble_phy_data.tifs_usecs;
    tifs_anchor = g_ble_phy_data.tifs_anchor;

    g_ble_phy_data.phy_transition = PHY_TRANS_NONE;
    g_ble_phy_data.tifs_anchor = PHY_TRANS_ANCHOR_END;
    g_ble_phy_data.tifs_usecs = BLE_LL_IFS;
    g_ble_phy_data.wfr_usecs = 0;

    if (g_ble_phy_data.txend_cb) {
        g_ble_phy_data.txend_cb(g_ble_phy_data.txend_arg);
    }

    ble_phy_transition(transition, tifs_anchor, tifs_usecs, wfr_usecs, BLE_PHY_STATE_TX);
}

static inline uint8_t
ble_phy_get_cur_rx_phy_mode(void)
{
    uint8_t phy;

    phy = g_ble_phy_data.phy_cur_phy_mode;

#if MYNEWT_VAL(BLE_LL_CFG_FEAT_LE_CODED_PHY)
    /*
     * For Coded PHY mode can be set to either codings since actual coding is
     * set in packet header. However, here we need actual coding of received
     * packet as this determines pipeline delays so need to figure this out
     * using CI field.
     */
    if ((phy == BLE_PHY_MODE_CODED_125KBPS) ||
                                    (phy == BLE_PHY_MODE_CODED_500KBPS)) {
        phy = NRF_RADIO->PDUSTAT & RADIO_PDUSTAT_CISTAT_Msk ?
                                   BLE_PHY_MODE_CODED_500KBPS :
                                   BLE_PHY_MODE_CODED_125KBPS;
    }
#endif

    return phy;
}

static void
ble_phy_rx_end_isr(void)
{
    int rc;
    uint8_t *dptr;
    struct ble_mbuf_hdr *ble_hdr;
    uint8_t crcok;

    /* Disable automatic RXEN */
    phy_ppi_timer0_compare0_to_radio_rxen_disable();
    /* Disable automatic RX START */
    phy_ppi_timer0_compare0_to_radio_start_disable();

#if MYNEWT_VAL(BLE_CHANNEL_SOUNDING)
    g_ble_phy_data.rxend_time_ticks = NRF_TIMER0->CC[2] -
            g_ble_phy_t_rxenddelay[g_ble_phy_data.phy_rx_phy_mode];
#endif

    /* Set RSSI and CRC status flag in header */
    ble_hdr = &g_ble_phy_data.rxhdr;
#ifndef NRF54L_SERIES
    assert(NRF_RADIO->EVENTS_RSSIEND != 0);
#endif
    ble_hdr->rxinfo.rssi = (-1 * NRF_RADIO->RSSISAMPLE);

    dptr = (uint8_t *)&g_ble_phy_rx_buf[0];
    dptr += 3;

    /* Count PHY crc errors and valid packets */
    crcok = NRF_RADIO->EVENTS_CRCOK;
    if ((NRF_RADIO->CRCCNF & RADIO_CRCCNF_LEN_Msk) == 0) {
        /* CRC disabled */
    } else if (!crcok) {
        STATS_INC(ble_phy_stats, rx_crc_err);
    } else {
        STATS_INC(ble_phy_stats, rx_valid);
        ble_hdr->rxinfo.flags |= BLE_MBUF_HDR_F_CRC_OK;
#if MYNEWT_VAL(BLE_LL_CFG_FEAT_LE_ENCRYPTION)
        if (g_ble_phy_data.phy_encrypted) {
#ifdef NRF54L_SERIES
            while (NRF_CCM->EVENTS_END == 0) {
#else
            while (NRF_CCM->EVENTS_ENDCRYPT == 0) {
#endif
                /* Make sure CCM finished */
            };

            /* Only set MIC failure flag if frame is not zero length */
            if ((dptr[1] != 0) &&
#ifdef NRF54L_SERIES
                (NRF_CCM->MACSTATUS == 0)) {
#else
                (NRF_CCM->MICSTATUS == 0)) {
#endif
                ble_hdr->rxinfo.flags |= BLE_MBUF_HDR_F_MIC_FAILURE;
            }

            /*
             * XXX: not sure how to deal with this. This should not
             * be a MIC failure but we should not hand it up. I guess
             * this is just some form of rx error and that is how we
             * handle it? For now, just set CRC error flags
             */
            if (NRF_CCM->EVENTS_ERROR) {
                STATS_INC(ble_phy_stats, rx_hw_err);
                ble_hdr->rxinfo.flags &= ~BLE_MBUF_HDR_F_CRC_OK;
            }
        }
#endif
    }

    /*
     * Let's schedule TX now and we will just cancel it after processing RXed
     * packet if we don't need TX.
     *
     * We need this to initiate connection in case AUX_CONNECT_REQ was sent on
     * LE Coded S8. In this case the time we process RXed packet is roughly the
     * same as the limit when we need to have TX scheduled (i.e. TIMER0 and PPI
     * armed) so we may simply miss the slot and set the timer in the past.
     *
     * When TX is scheduled in advance, we may event process packet a bit longer
     * during radio ramp-up - this gives us extra 40 usecs which is more than
     * enough.
     */
    if (g_ble_phy_data.phy_transition == PHY_TRANS_NONE) {
        /* XXX: Should be removed after finding all missing uses of ble_phy_transition_set */
        g_ble_phy_data.phy_transition = PHY_TRANS_TO_TX;
    }

    ble_phy_transition(g_ble_phy_data.phy_transition,
                       g_ble_phy_data.tifs_anchor,
                       g_ble_phy_data.tifs_usecs,
                       g_ble_phy_data.wfr_usecs,
                       BLE_PHY_STATE_RX);

    g_ble_phy_data.phy_transition = PHY_TRANS_NONE;
    g_ble_phy_data.tifs_anchor = PHY_TRANS_ANCHOR_END;
    g_ble_phy_data.tifs_usecs = BLE_LL_IFS;
    g_ble_phy_data.wfr_usecs = 0;

