mkasenberg/mynewt-nimble/nimble/drivers/nrf5x/src/ble_phy.c
#if MYNEWT_VAL(BLE_CHANNEL_SOUNDING)
void
ble_phy_get_txend_time(uint32_t *cputime, uint32_t *rem_us, uint32_t *rem_ns)
{
    *cputime = g_ble_phy_data.phy_start_cputime;
    *rem_us = RADIO_TIMER_TICKS_TO_US(g_ble_phy_data.txend_time_ticks);
    *rem_ns = (g_ble_phy_data.txend_time_ticks - RADIO_TIMER_US_TO_TICKS(*rem_us)) *
              (1000 / g_ble_phy_data.radio_timer_ticks_per_us);
}

void
ble_phy_get_rxend_time(uint32_t *cputime, uint32_t *rem_us, uint32_t *rem_ns)
{
    *cputime = g_ble_phy_data.phy_start_cputime;
    *rem_us = RADIO_TIMER_TICKS_TO_US(g_ble_phy_data.rxend_time_ticks);
    *rem_ns = (g_ble_phy_data.rxend_time_ticks - RADIO_TIMER_US_TO_TICKS(*rem_us)) *
              (1000 / g_ble_phy_data.radio_timer_ticks_per_us);
}

void
ble_phy_cs_sync_mode_set(uint8_t mode)
{
#if !BABBLESIM
    if (mode == 0) {
        /* Configure back the registers */
        NRF_RADIO->CRCCNF = (RADIO_CRCCNF_SKIPADDR_Skip << RADIO_CRCCNF_SKIPADDR_Pos) | RADIO_CRCCNF_LEN_Three;
        NRF_RADIO->PCNF0 = NRF_PCNF0;
        NRF_RADIO->PCNF1 = NRF_MAXLEN |
                       (RADIO_PCNF1_ENDIAN_Little <<  RADIO_PCNF1_ENDIAN_Pos) |
                       (NRF_BALEN << RADIO_PCNF1_BALEN_Pos) |
                       RADIO_PCNF1_WHITEEN_Msk;

#if TIMER00_AS_RADIO_TIMER
        nrf_timer_task_trigger(NRF_TIMER00, NRF_TIMER_TASK_STOP);
        NRF_TIMER00->PRESCALER = 7;
#endif
        g_ble_phy_data.radio_timer_ticks_per_us = 1;
        g_ble_phy_data.phy_bcc = 8;
        //        NRF_RADIO->RTT.CONFIG = 0;
    } else {
        /* CS SYNC packet has no PDU or CRC */
        NRF_RADIO->CRCCNF = (RADIO_CRCCNF_SKIPADDR_Skip << RADIO_CRCCNF_SKIPADDR_Pos);
        /* CS_SYNC needs only PAYLOAD field, so do not trasmit S0, LENGTH and S1 fields. */
        NRF_RADIO->PCNF0 = RADIO_PCNF0_S1INCL_Include << RADIO_PCNF0_S1INCL_Pos;
        /* Disable whitening */
        NRF_RADIO->PCNF1 = (RADIO_PCNF1_ENDIAN_Little <<  RADIO_PCNF1_ENDIAN_Pos) |
                           (NRF_BALEN << RADIO_PCNF1_BALEN_Pos);
#if TIMER00_AS_RADIO_TIMER
        nrf_timer_task_trigger(NRF_TIMER00, NRF_TIMER_TASK_STOP);
        NRF_TIMER00->PRESCALER = 0;  /* gives us 128MHz */
        g_ble_phy_data.radio_timer_ticks_per_us = 128;
#endif
        g_ble_phy_data.phy_bcc = 0;
//        NRF_RADIO->RTT.CONFIG = RADIO_RTT_CONFIG_EN_Enabled << RADIO_RTT_CONFIG_EN_Pos |
//                                RADIO_RTT_CONFIG_ENFULLAA_Enabled << RADIO_RTT_CONFIG_ENFULLAA_Pos |
//                                RADIO_RTT_CONFIG_ROLE_Reflector << RADIO_RTT_CONFIG_ROLE_Pos |
//                                (256UL) << RADIO_RTT_CONFIG_EFSDELAY_Pos;
    }
#endif
}

int
ble_phy_tx_cs_sync(ble_phy_tx_cs_sync_cb_t pktcb, void *pktcb_arg)
{
    int rc;

    /* Temporary, for babblesim testing */
    rc = ble_phy_tx(pktcb, pktcb_arg);
    /* TODO: Adjustments for CS SYNC packet:
     * - Turn off CRC
     * - set 4 bits in S1
     */
    return rc;
}

int
ble_phy_cs_sync_configure(uint8_t chan, uint32_t access_addr)
{
#if BABBLESIM
    ble_phy_setchan(chan % 40, access_addr, 0);
#else
    assert(!(chan <= 1 || (23 <= chan && chan <= 25) || 77 <= chan));

    /* Check for valid channel range */
    if (chan <= 1 || (23 <= chan && chan <= 25) || 77 <= chan) {
        return BLE_PHY_ERR_INV_PARAM;
    }

    /* Set current access address */
    ble_phy_set_access_addr(access_addr);

    /* Set the frequency and the data whitening initial value */
    g_ble_phy_data.phy_chan = chan;
    NRF_RADIO->FREQUENCY = 2 + chan;
#endif

    return 0;
}
#endif

static uint8_t
cs_tone_tx_make(uint8_t *dptr, void *arg, uint8_t *hdr_byte)
{
    uint8_t pdu_len;
    struct ble_ll_cs_sm *cssm = arg;

    pdu_len = 0;
    *hdr_byte = 0;

    return pdu_len;
}

int
ble_phy_tx_cs_tone(uint16_t duration_usecs)
{
    int rc = 0;
    uint32_t end_time;

#if BABBLESIM
    end_time = NRF_TIMER0->CC[0] + duration_usecs;
    ble_phy_wfr_enable_at(end_time);
#else
    if (NRF_RADIO->STATE == RADIO_STATE_STATE_Disabled) {
        /* Temporary, for babblesim testing */
        rc = ble_phy_tx(cs_tone_tx_make, NULL);

        /* There will not be PHY_END and DISABLED event,
         * because no packet will be sent. Let's use wfr as a timer.
         */
#if TIMER00_AS_RADIO_TIMER
        end_time = NRF_TIMER00->CC[0] + RADIO_TIMER_US_TO_TICKS(duration_usecs);
#else
        end_time = NRF_TIMER0->CC[0] + RADIO_TIMER_US_TO_TICKS(duration_usecs);
#endif
        ble_phy_wfr_enable_at(end_time);
    } else {
        rc = ble_phy_transition(BLE_PHY_TRANSITION_TO_TX, PHY_TRANS_ANCHOR_END,
                                g_ble_phy_data.tifs_usecs, duration_usecs,
                                BLE_PHY_STATE_TX);
    }
#endif

    return rc;
}

int
ble_phy_rx_cs_tone(uint16_t duration_usecs)
{
    int rc = 0;
    uint32_t anchor_usecs;
    uint32_t start_time;
    uint32_t end_time;
#if BABBLESIM
    end_time = NRF_TIMER0->CC[0] + duration_usecs;
    ble_phy_wfr_enable_at(end_time);
#else
    uint8_t tpm = NRF_RADIO->CSTONES.MODE & RADIO_CSTONES_MODE_TPM_Msk;

    ble_phy_cs_tone_mode_set(1);

#if TIMER00_AS_RADIO_TIMER
    anchor_usecs = RADIO_TIMER_TICKS_TO_US(NRF_TIMER00->CC[0]);
#else
    anchor_usecs = RADIO_TIMER_TICKS_TO_US(NRF_TIMER0->CC[0]);
#endif

    if (NRF_RADIO->STATE == RADIO_STATE_STATE_Disabled) {
        /* First CS tone slot, no CS_SYNC before */

        /* anchor is start of current tone slot */
        end_time = anchor_usecs + duration_usecs;
        ble_phy_wfr_enable_at(RADIO_TIMER_US_TO_TICKS(end_time));
    } else if (tpm) {
        /* Subsequent CS tone slot */

        /* anchor is start of previous tone slot */
        start_time = anchor_usecs + duration_usecs;
        NRF_TIMER0->CC[0] = RADIO_TIMER_US_TO_TICKS(start_time);
        phy_ppi_timer0_compare0_to_radio_start_enable();

        end_time = start_time + duration_usecs;
        ble_phy_wfr_enable_at(RADIO_TIMER_US_TO_TICKS(end_time));
    } else {
        /* Transition from CS_SYNC reception */
        rc = ble_phy_transition(BLE_PHY_TRANSITION_TO_RX, PHY_TRANS_ANCHOR_END,
                                g_ble_phy_data.tifs_usecs, duration_usecs,
                                BLE_PHY_STATE_RX);
    }
#endif

    return rc;
}

void
ble_phy_cs_tone_mode_set(uint8_t mode)
{
#if !BABBLESIM
    if (mode == 0) {
        NRF_RADIO->CSTONES.MODE = 0;
    } else if (mode == 1) {
        NRF_RADIO->CSTONES.MODE = RADIO_CSTONES_MODE_TPM_Msk;
        NRF_RADIO->CSTONES.NUMSAMPLES = RADIO_CSTONES_NUMSAMPLES_ResetValue;
        NRF_RADIO->CSTONES.NEXTFREQUENCY = 0;
//        NRF_RADIO->CSTONES.PHASESHIFT = 0;
//        NRF_RADIO->CSTONES.NUMSAMPLESCOEFF = 0;
    } else { /* mode == 2 */
        NRF_RADIO->CSTONES.MODE = RADIO_CSTONES_MODE_TFM_Msk;
        NRF_RADIO->CSTONES.NUMSAMPLES = RADIO_CSTONES_NUMSAMPLES_ResetValue;
        NRF_RADIO->CSTONES.NEXTFREQUENCY = 0;
    }
#endif
}
